BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega329P.PIC
        <edc:SFRDef edc:_addr="0xF4" edc:access="nnnnnnnn" edc:cname="LCDDR8" edc:nzwidth="0x8" ltx:memberofperipheral="LCD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG124" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG125" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG126" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG127" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG128" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG129" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG130" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG131" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xF5" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xF6" edc:access="nnnnnnnn" edc:cname="LCDDR10" edc:nzwidth="0x8" ltx:memberofperipheral="LCD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG200" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG201" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG202" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG203" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG204" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG205" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG206" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG207" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF7" edc:access="nnnnnnnn" edc:cname="LCDDR11" edc:nzwidth="0x8" ltx:memberofperipheral="LCD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG208" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG209" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG210" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG211" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG212" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG213" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG214" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG215" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF8" edc:access="nnnnnnnn" edc:cname="LCDDR12" edc:nzwidth="0x8" ltx:memberofperipheral="LCD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG216" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG217" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG218" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG219" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG220" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG221" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG222" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG223" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF9" edc:access="nnnnnnnn" edc:cname="LCDDR13" edc:nzwidth="0x8" ltx:memberofperipheral="LCD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG224" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG225" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG226" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG227" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG228" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG229" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG230" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG231" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xFA" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xFB" edc:access="nnnnnnnn" edc:cname="LCDDR15" edc:nzwidth="0x8" ltx:memberofperipheral="LCD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG300" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG301" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG302" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG303" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG304" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG305" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG306" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG307" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
